Tekla Open API Reference for Tekla Structures 2025
SpiralBeamDataException.ErrorStatus Field
 Contains error status during spiral beam creation/modification.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public readonly SpiralBeam.ErrorStatus ErrorStatus
Public ReadOnly ErrorStatus As SpiralBeam.ErrorStatus
Field Value
Type: SpiralBeam.ErrorStatus
See Also
Reference
SpiralBeamDataException Class
Tekla.Structures.Model Namespace